# **Interview Questions 1 - Python**

**Conversion 1: Array to DataFrame**

    Example 1

In [2]:
import numpy as np
import pandas as pd

marks = np.array([[11, 22, 33], [44, 55, 66]])
df = pd.DataFrame(marks, columns = ['Subject 1', 'Subject 2', 'Subject 3'])

print(df)

   Subject 1  Subject 2  Subject 3
0         11         22         33
1         44         55         66

In [3]:
import numpy as np
import pandas as pd

marks = np.array([[11, 22, 33], [44, 55, 66]])
df = pd.DataFrame(marks, columns = ['Subject 1', 'Subject 2', 'Subject 3'], index = ['Anu', 'John'])

print(df)

      Subject 1  Subject 2  Subject 3
Anu          11         22         33
John         44         55         66

    Example 2

In [4]:
import numpy as np
import pandas as pd

student_details = np.array([['jon', 25, 1995,2026], ['Maria', 47, 1973, 2000], ['Bill', 38, 1982, 2005]], dtype = object)
df = pd.DataFrame(student_details, columns = ['Name', 'Age', 'Birth Year', 'Graduation Year'])

print(df)

    Name Age Birth Year Graduation Year
0    jon  25       1995            2026
1  Maria  47       1973            2000
2   Bill  38       1982            2005

In [5]:
import numpy as np
import pandas as pd

student_details = np.array([['jon', 25, 1995,2026], ['Maria', 47, 1973, 2000], ['Bill', 38, 1982, 2005]], dtype = object)
df = pd.DataFrame(student_details, columns = ['Name', 'Age', 'Birth Year', 'Graduation Year'])

print(df)
print(type(df))
print(df.dtypes)

    Name Age Birth Year Graduation Year
0    jon  25       1995            2026
1  Maria  47       1973            2000
2   Bill  38       1982            2005
<class 'pandas.core.frame.DataFrame'>
Name               object
Age                object
Birth Year         object
Graduation Year    object
dtype: object

In [6]:
import numpy as np
import pandas as pd

student_details = np.array([['jon', 25, 1995,2026], ['Maria', 47, 1973, 2000], ['Bill', 38, 1982, 2005]], dtype = object)
df = pd.DataFrame(student_details, columns = ['Name', 'Age', 'Birth Year', 'Graduation Year'])

df['Age'] = df['Age'].astype(int)
df['Birth Year'] = df['Birth Year'].astype(int)
df['Graduation Year'] = df['Graduation Year'].astype(int)

print(df)
print(type(df))
print(df.dtypes)

    Name  Age  Birth Year  Graduation Year
0    jon   25        1995             2026
1  Maria   47        1973             2000
2   Bill   38        1982             2005
<class 'pandas.core.frame.DataFrame'>
Name               object
Age                 int64
Birth Year          int64
Graduation Year     int64
dtype: object

    Example 3

In [7]:
import numpy as np
import pandas as pd

# create pandas as DataFrame
df = pd.DataFrame({'Game 1': [25, 12, 15, 14, 19, 23, 25, 29],
                   'Game 2': [5, 7, 7, 9, 12, 9, 9, 4],
                   'Game 3': [11, 8, 10, 6, 6, 5, 9, 12]})

# create NumPy array for Game 4
Game4 = np.array([2, 3, 1, 0, 2, 7, 8, 2])

# add 'Game 4' array as new column in DataFrame
df['Game 4'] = Game4.tolist()

# display the DataFrame
print(df)

   Game 1  Game 2  Game 3  Game 4
0      25       5      11       2
1      12       7       8       3
2      15       7      10       1
3      14       9       6       0
4      19      12       6       2
5      23       9       5       7
6      25       9       9       8
7      29       4      12       2